Repository: Ali-albakre/mmmmm
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Smart Accounting
ar: المحاسب الذكي

# onboardingTitle
source: Welcome
ar: مرحبًا

# onboardingSubtitle
source: Set your preferred language, currency, and inventory mode.
ar: حدد اللغة والعملة الافتراضية ووضع المخزون.

# chooseLanguage
source: Language
ar: اللغة

# chooseCurrency
source: Default currency
ar: العملة الافتراضية

# chooseInventoryMode
source: Inventory mode
ar: وضع المخزون

# inventorySimple
source: Simple (no stock)
ar: مبسط (بدون مخزون)

# inventoryFull
source: Full inventory
ar: مخزون كامل

# currencyYER
source: YER
ar: ريال يمني

# currencySAR
source: SAR
ar: ريال سعودي

# languageArabic
source: Arabic
ar: العربية

# languageEnglish
source: English
ar: الإنجليزية

# continueLabel
source: Continue
ar: متابعة

# dashboardTitle
source: Dashboard
ar: لوحة التحكم

# dashboardSales
source: Sales
ar: المبيعات

# dashboardPurchases
source: Purchases
ar: المشتريات

# dashboardExpenses
source: Expenses
ar: المصروفات

# dashboardExpiryAlerts
source: Expiry alerts
ar: تنبيهات انتهاء الصلاحية

# dashboardLastUpdated
source: Last updated: {date}
ar: آخر تحديث: {date}

# dashboardPeriodDaily
source: Daily
ar: يومي

# dashboardPeriodWeekly
source: Weekly
ar: أسبوعي

# dashboardPeriodMonthly
source: Monthly
ar: شهري

# dashboardCurrentAgency
source: Current agency
ar: الوكالة الحالية

# dashboardLastUpdatedShort
source: Last updated {time} ago
ar: آخر تحديث منذ {time}

# dashboardScanDocument
source: Scan document
ar: مسح مستند

# dashboardNetBalance
source: Net balance
ar: صافي الرصيد

# dashboardTotalPurchases
source: Total purchases
ar: إجمالي المشتريات

# dashboardReturns
source: Returns
ar: المرتجعات

# dashboardDisbursements
source: Disbursements
ar: سندات الصرف

# dashboardExportReport
source: Export report
ar: تصدير تقرير

# dashboardAddManual
source: Add manual entry
ar: إضافة يدوية

# dashboardHelp
source: Help center
ar: المساعدة

# dashboardManageAgency
source: Manage agency
ar: إدارة الوكالة

# dashboardRecentOperations
source: Recent operations
ar: آخر العمليات

# dashboardViewAll
source: View all
ar: عرض الكل

# dashboardColumnDocument
source: Document
ar: المستند

# dashboardColumnType
source: Type
ar: نوع العملية

# dashboardColumnDate
source: Date
ar: التاريخ

# dashboardColumnNumber
source: No.
ar: رقم الفاتورة

# dashboardNoAgencyTitle
source: No agency selected yet
ar: لا توجد وكالة محددة بعد

# dashboardNoAgencySubtitle
source: Create your first agency to start tracking transactions.
ar: أنشئ أول وكالة للبدء في تتبع العمليات.

# dashboardSelectAgency
source: Select agency
ar: اختيار الوكالة

# dashboardSampleAgencyName
source: Advanced Tech Agency
ar: وكالة التقنية المتقدمة

# dashboardSampleUpdatedTime
source: 5 min
ar: 5 دقائق

# scanTitle
source: Scan document
ar: مسح مستند

# scanSubtitle
source: Choose a source to capture the document.
ar: اختر المصدر لالتقاط المستند.

# scanFromCamera
source: Camera
ar: الكاميرا

# scanFromCameraHint
source: Capture a new photo.
ar: التقاط صورة جديدة.

# scanFromGallery
source: Gallery
ar: المعرض

# scanFromGalleryHint
source: Pick one or more photos.
ar: اختيار صورة أو أكثر.

# scanFromPdf
source: PDF file
ar: ملف PDF

# scanFromPdfHint
source: Import a PDF document.
ar: استيراد مستند PDF.

# scanContinue
source: Continue
ar: متابعة

# scanClearSelection
source: Clear
ar: مسح

# scanSelectedImages
source: Selected images: {count}
ar: عدد الصور المختارة: {count}

# scanSelectedPdf
source: Selected PDF file
ar: تم اختيار ملف PDF

# scanError
source: Could not complete the request: {message}
ar: تعذر إكمال الطلب: {message}

# manualEntryTitle
source: Manual entry
ar: إضافة يدوية

# manualEntryDetailsTitle
source: Transaction details
ar: تفاصيل العملية

# manualEntryOcrTitle
source: OCR extraction
ar: نتائج المسح

# manualEntryOcrInProgress
source: Extracting data from the document...
ar: جارٍ استخراج البيانات من المستند...

# manualEntryOcrPdfNotice
source: PDF OCR is not available yet. Please enter details manually.
ar: استخراج PDF غير متاح حاليًا، يرجى إدخال البيانات يدويًا.

# manualEntryOcrFailedReason
source: Reason: {message}
ar: السبب: {message}

# manualEntryOcrFailed
source: Could not extract data. Please enter details manually.
ar: تعذر استخراج البيانات، يرجى الإدخال يدويًا.

# manualEntryOcrNoData
source: No extractable data found yet.
ar: لم يتم العثور على بيانات واضحة بعد.

# manualEntryOcrInvoice
source: Invoice: {value}
ar: رقم الفاتورة: {value}

# manualEntryOcrDate
source: Date: {value}
ar: التاريخ: {value}

# manualEntryOcrTotal
source: Total: {value}
ar: الإجمالي: {value}

# manualEntryInvoiceNumber
source: Invoice number (optional)
ar: رقم الفاتورة (اختياري)

# manualEntryAmount
source: Amount
ar: المبلغ

# manualEntryAmountRequired
source: Amount is required.
ar: المبلغ مطلوب.

# manualEntryAmountInvalid
source: Enter a valid amount.
ar: أدخل مبلغًا صحيحًا.

# manualEntryDate
source: Transaction date
ar: تاريخ العملية

# manualEntryDateRequired
source: Select a transaction date.
ar: اختر تاريخ العملية.

# manualEntryTransactionType
source: Invoice type
ar: نوع الفاتورة

# manualEntryTransactionTypeRequired
source: Select an invoice type.
ar: اختر نوع الفاتورة.

# manualEntryNotes
source: Notes (optional)
ar: ملاحظات (اختياري)

# manualEntrySave
source: Save entry
ar: حفظ العملية

# manualEntryConfirmTitle
source: Confirm save
ar: تأكيد الحفظ

# manualEntryConfirmMessage
source: This will save the entry and update the dashboard.
ar: سيتم حفظ العملية وتحديث لوحة التحكم.

# manualEntryCancel
source: Cancel
ar: إلغاء

# manualEntryConfirm
source: Confirm
ar: تأكيد

# manualEntrySaved
source: Entry saved.
ar: تم حفظ العملية.

# manualEntryNoAgency
source: Please select an agency before saving.
ar: يرجى اختيار وكالة قبل الحفظ.

# transactionTypePurchase
source: Purchase
ar: مشتريات

# transactionTypeReturn
source: Return
ar: مرتجع

# transactionTypeDisbursement
source: Disbursement
ar: سند صرف

# transactionTypeOpening
source: Opening balance
ar: رصيد افتتاحي

# transactionTypePurchaseCredit
source: Purchase (credit)
ar: شراء آجل

# transactionTypePayment
source: Payment
ar: دفعة/سند قبض

# transactionTypeOpeningBalance
source: Opening balance
ar: قيد افتتاحي

# transactionTypePurchaseCash
source: Purchase (cash)
ar: شراء نقدي

# transactionTypeCompensation
source: Compensation
ar: تعويض/بونص

# reportsTitle
source: Reports
ar: التقارير

# reportsSetupTitle
source: Generate report
ar: إنشاء تقرير

# reportsTypeLabel
source: Report type
ar: نوع التقرير

# reportsTypeStatement
source: Statement
ar: كشف حساب تفصيلي

# reportsTypeMonthlySummary
source: Monthly summary
ar: ملخص شهري

# reportsTypePurchases
source: Purchases
ar: المشتريات فقط

# reportsTypePurchasesCredit
source: Purchases (credit)
ar: المشتريات الآجلة

# reportsTypePayments
source: Payments
ar: السداد/الدفعات

# reportsTypeReturns
source: Returns
ar: المرتجعات فقط

# reportsTypePurchasesCash
source: Purchases (cash)
ar: المشتريات النقدية

# reportsTypeCompensation
source: Compensation
ar: التعويضات/البونص

# reportsPeriodLabel
source: Period
ar: الفترة

# reportsPeriodHint
source: Select period
ar: اختر الفترة

# reportsGenerate
source: Generate report
ar: إنشاء التقرير

# reportsGenerating
source: Generating...
ar: جارٍ إنشاء التقرير...

# reportsTableTitle
source: Report table
ar: جدول التقرير

# reportsColumnAmount
source: Amount
ar: المبلغ

# reportsNoDataToExport
source: No data to export.
ar: لا توجد بيانات للتصدير.

# reportsExportFailed
source: Failed to export report.
ar: تعذر تصدير التقرير.

# reportsSaved
source: Report saved: {path}
ar: تم حفظ التقرير: {path}

# reportsCreatedNoFile
source: Report created, but no file was saved yet.
ar: تم إنشاء التقرير، لكن لم يتم حفظ الملف بعد.

# reportsRecentTitle
source: Recent reports
ar: آخر التقارير

# reportsEmpty
source: No reports generated yet.
ar: لا توجد تقارير بعد.

# helpTitle
source: Help center
ar: مركز المساعدة

# helpAccuracyTitle
source: How accurate is OCR?
ar: ما مدى دقة OCR؟

# helpAccuracyBody
source: Accuracy depends on image clarity. Use clear, well-lit scans for best results.
ar: تعتمد الدقة على جودة الصورة. استخدم صورًا واضحة وبإضاءة جيدة.

# helpCorrectionsTitle
source: How do I correct extracted data?
ar: كيف أصحح البيانات المستخرجة؟

# helpCorrectionsBody
source: Use the manual edit screen to fix fields before posting the transaction.
ar: يمكنك تعديل الحقول يدويًا قبل ترحيل العملية.

# helpDuplicatesTitle
source: How are duplicates detected?
ar: كيف يتم كشف التكرار؟

# helpDuplicatesBody
source: We check invoice number, date, and amount to flag possible duplicates.
ar: نستخدم رقم الفاتورة والتاريخ والمبلغ لاكتشاف التكرار المحتمل.

# helpReportsTitle
source: How do I export reports?
ar: كيف أصدّر التقارير؟

# helpReportsBody
source: Choose a report type, period, and format, then generate the report from the Reports screen.
ar: اختر نوع التقرير والفترة والصيغة ثم أنشئ التقرير من شاشة التقارير.

# agenciesTitle
source: Agencies
ar: الوكالات

# agenciesEmpty
source: No agencies yet. Add your first agency to start tracking balances.
ar: لا توجد وكالات بعد. أضف وكالتك الأولى للبدء.

# agenciesCreate
source: Add agency
ar: إضافة وكالة

# agenciesName
source: Agency name
ar: اسم الوكالة

# agenciesOpeningBalanceLabel
source: Opening balance
ar: الرصيد الافتتاحي

# agenciesSave
source: Save agency
ar: حفظ الوكالة

# agenciesOpeningBalance
source: Opening balance: {amount}
ar: الرصيد الافتتاحي: {amount}

# recentOperationsTitle
source: Recent operations
ar: آخر العمليات

# recentOperationsEmpty
source: No operations yet.
ar: لا توجد عمليات بعد.

# drawerDashboard
source: Dashboard
ar: لوحة التحكم

# drawerScan
source: Scan document
ar: مسح مستند

# drawerManualEntry
source: Manual entry
ar: إضافة يدوية

# drawerReports
source: Reports
ar: التقارير

# drawerAgencies
source: Agencies
ar: الوكالات

# drawerHelp
source: Help center
ar: المساعدة

# dashboardQuickActions
source: Quick actions
ar: الإجراءات السريعة

# dashboardActionNewEntry
source: New entry
ar: قيد جديد

# dashboardActionInvoice
source: Invoice
ar: فاتورة

# dashboardActionChart
source: Chart of accounts
ar: دليل الحسابات

# dashboardActionLedger
source: Ledger
ar: دفتر الأستاذ

# dashboardActionArchive
source: Archive
ar: الأرشيف

# dashboardActionBackup
source: Backup
ar: نسخ احتياطي

# dashboardAlerts
source: Alerts
ar: التنبيهات

# dashboardNoAlerts
source: No alerts yet
ar: لا توجد تنبيهات بعد

# dashboardCharts
source: Charts
ar: المخططات

# dashboardNoCharts
source: No charts yet
ar: لا توجد مخططات بعد

# dashboardRecentEntries
source: Recent entries
ar: آخر القيود

# dashboardNoRecentEntries
source: No entries yet
ar: لا توجد قيود بعد

# dashboardNoCards
source: No cards to show
ar: لا توجد بطاقات للعرض

# dashboardCustomize
source: Customize dashboard
ar: تخصيص اللوحة

# dashboardSectionQuickActions
source: Show quick actions
ar: إظهار الإجراءات السريعة

# dashboardSectionAlerts
source: Show alerts
ar: إظهار التنبيهات

# dashboardSectionCharts
source: Show charts
ar: إظهار المخططات

# dashboardSectionRecent
source: Show recent entries
ar: إظهار آخر القيود

# dashboardViewDetails
source: Details: {title}
ar: تفاصيل: {title}

# dashboardCopyValue
source: Copy value
ar: نسخ القيمة

# dashboardCopyTitle
source: Copy title
ar: نسخ العنوان

# emptyStateNoData
source: No data yet
ar: لا توجد بيانات بعد

# manualEntrySaveDraft
source: Save draft
ar: حفظ كمسودة

# manualEntryPost
source: Post entry
ar: ترحيل العملية

# transactionStatusPosted
source: Posted
ar: مرحّل

# transactionStatusDraft
source: Draft
ar: مسودة

# agenciesOpeningBalanceDate
source: Opening balance date
ar: تاريخ الرصيد الافتتاحي

# agenciesOpeningBalanceDateInvalid
source: Opening balance must be dated on Jan 1.
ar: يجب أن يكون تاريخ الرصيد الافتتاحي في 1 يناير.

# pdfReviewTitle
source: PDF pages
ar: صفحات PDF

# pdfReviewProcessing
source: Preparing PDF pages and extracting data...
ar: جاري تجهيز الصفحات واستخراج البيانات...

# pdfReviewNoPages
source: No pages found in the PDF.
ar: لا توجد صفحات في ملف PDF.

# pdfReviewPageLabel
source: Page {index}
ar: صفحة {index}

# pdfReviewOpenEntry
source: Open entry
ar: فتح الإدخال

# manualEntryCurrency
source: Invoice currency
ar: عملة الفاتورة

# manualEntryExchangeRate
source: Exchange rate to base currency
ar: سعر الصرف للعملة الأساسية

# manualEntryExchangeRateRequired
source: Enter a valid exchange rate.
ar: أدخل سعر صرف صحيح.

# agenciesPrimaryCurrency
source: Primary currency
ar: العملة الأساسية

# agenciesAllowedCurrencies
source: Allowed currencies
ar: العملات المسموحة

# drawerSettings
source: Settings
ar: الإعدادات

# settingsBackupTitle
source: Backup
ar: النسخ الاحتياطي

# settingsDriveBackupToggle
source: Daily Google Drive backup
ar: نسخ احتياطي يومي إلى Google Drive

# settingsDriveBackupHint
source: Upload a backup file to Drive at the end of each day.
ar: يرفع نسخة احتياطية في نهاية كل يوم.

# settingsDriveAccountTitle
source: Google Drive account
ar: حساب Google Drive

# settingsDriveAccountSubtitle
source: Connect a Google account to store backups.
ar: اربط حسابًا لحفظ النسخ الاحتياطية.

# settingsDriveAccountConnected
source: Connected
ar: متصل

# settingsConnect
source: Connect
ar: ربط

# settingsDisconnect
source: Disconnect
ar: فصل

# settingsLastBackup
source: Last backup
ar: آخر نسخة احتياطية

# settingsBackupNow
source: Backup now
ar: نسخ احتياطي الآن

# settingsBackupInProgress
source: Backing up...
ar: جارٍ النسخ...

# settingsBackupFailed
source: Backup failed: {message}
ar: فشل النسخ الاحتياطي: {message}

# settingsOcrTitle
source: OCR
ar: التعرف الضوئي

# settingsOcrCloudToggle
source: Use OCR.space cloud OCR
ar: استخدام OCR.space السحابي

# settingsOcrCloudHint
source: Sends images to OCR.space for better accuracy.
ar: يرسل الصور إلى OCR.space لتحسين الدقة.

# settingsTitle
source: Settings
ar: الإعدادات
